label_to_prompt = [
    '通信 网络 天线',       # 0
    '农业 植物 养殖',       # 1
    '制造 机械 装置',       # 2
    '数据处理 数据存储',    # 3
    '物联 区块链 交通',     # 4
    '化学 材料 工艺',       # 5
    '深度学习 算法 智能',   # 6
    '生态 环保 废弃处理',   # 7
    '疾病 护理 医疗',       # 8
    '图像 显示 视频',       # 9
    '光电 电子 元件',       # 10
    '焊接 机械 自动',       # 11
    '电极 金属 冶金',       # 12
    '电力 输电 电缆',       # 13    供电输电高度相关
    '光伏组件 太阳能',      # 14    太阳能发电高度相关
    '电动汽车 车用电池',    # 15    电动车辆高度相关
    '无机 晶体 涂层',       # 16
    '风力 风机 风电',       # 17    风力发电高度相关
    '药物 合成 制药',       # 18
    '复合 纳米 超导',       # 19    纳米超导材料高度相关
    '材料的测定与试验',     # 20
    '车辆 铁路 列车',       # 21
    '聚合 纺织 纤维',       # 22
    '航天 定位 导航',       # 23
    '水利 检测 测量',       # 24
    '洗砂 烧结 锅炉',       # 25
    '水产 加工 食品',       # 26
    '核技术 反应堆 核电',   # 27    核电高度相关
    '开采 船舶 海洋',       # 28
    '航天 航空 飞行',       # 29
    '信息 推送 广告',       # 30    广告推送高度相关
    '家居 住宅 建筑 '       # 31
]